# Naive Bayes

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

### Data exploration

In [3]:
#drop features that arent important
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

In [5]:
#sex column is text -> convert dummy columns
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
#append the dummies
inputs = pd.concat([inputs,dummies], axis = 1)
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
#drop the sex column
inputs.drop('Sex', axis = 1, inplace = True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [8]:
#find NaN
inputs.columns[inputs.isna().any()]
#age column have NaN

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:15]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
Name: Age, dtype: float64

In [11]:
#fill with the mean value of the column
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

### Model

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size = 0.2)

In [16]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [17]:
model.fit(X_train,y_train)

GaussianNB()

In [18]:
model.score(X_test, y_test)

0.7877094972067039

In [19]:
X_test[:10]

     Pclass        Age     Fare  female  male
823       3  27.000000  12.4750       1     0
416       2  34.000000  32.5000       1     0
475       1  29.699118  52.0000       0     1
826       3  29.699118  56.4958       0     1
864       2  24.000000  13.0000       0     1
485       3  29.699118  25.4667       1     0
766       1  29.699118  39.6000       0     1
646       3  19.000000   7.8958       0     1
831       2   0.830000  18.7500       0     1
674       2  29.699118   0.0000       0     1

In [20]:
y_test[:10]

823    1
416    1
475    0
826    0
864    0
485    0
766    0
646    0
831    1
674    0
Name: Survived, dtype: int64

In [21]:
model.predict(X_test[:10]) #commparing with the results of y_test it failed some

array([1, 1, 0, 0, 0, 1, 0, 0, 0, 0])

In [22]:
#calculate the probabilities of each class -> 1st column: probability didn't survive, 2nd: prob survive
model.predict_proba(X_test[:10])

array([[0.0812347 , 0.9187653 ],
       [0.03607358, 0.96392642],
       [0.8602702 , 0.1397298 ],
       [0.97801256, 0.02198744],
       [0.97729261, 0.02270739],
       [0.08027118, 0.91972882],
       [0.8996225 , 0.1003775 ],
       [0.98808737, 0.01191263],
       [0.95220467, 0.04779533],
       [0.97670692, 0.02329308]])